/******************************************************************************
Copyright (C) 2021-2023 广州敏视数码科技有限公司版权所有.

文件名：adas.h

日期: 2022-03-03

文件功能描述: 定义ADAS算法功能接口

其他: // 其他内容说明

版本: v1.0.0(最新版本号)

*******************************************************************************/
#ifndef _ADAS_H_
#define _ADAS_H_
#include "../../../include/common.h"
#include "config.h"

/* 模块配置参数 / Module configuration parameters */
typedef struct tag_AdasCfg_S
{
    sint32          s32MediaBufFd;      /* 媒体通道Media Buffer的文件描述符 */
    CFG_ALG_PARAM   stAlgParam;         /* 算法配置参数 */
} ADAS_CFG_PARAM_S;

/******************************************************************************
 * 函数功能: 初始化ADAS算法模块
 * 输入参数: pstInitParam --- 初始化配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             ERR_NULL_PTR - 传入参数指针为NULL
             SV_FAILURE - 失败
 * 注意    : 无
 *****************************************************************************/
extern sint32 ADAS_Init(ADAS_CFG_PARAM_S *pstInitParam);

/******************************************************************************
 * 函数功能: 去初始化ADAS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 无
 *****************************************************************************/
extern sint32 ADAS_Fini();

/******************************************************************************
 * 函数功能: 启动ADAS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 ADAS_Start();

/******************************************************************************
 * 函数功能: 停止ADAS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 ADAS_Stop();

/******************************************************************************
 * 函数功能: 设置ADAS算法模块配置参数
 * 输入参数: pstConnCfg --- 配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 ADAS_ConfigSet(CFG_ALG_PARAM *pstCfgParam);

#endif  /* _ADAS_H_ */