/******************************************************************************
Copyright (C) 2021-2023 广州敏视数码科技有限公司版权所有.

文件名：dmm.h

日期: 2021-08-03

文件功能描述: 定义DMS算法功能接口

其他: // 其他内容说明

版本: v1.0.0(最新版本号)

*******************************************************************************/
#ifndef _DMM_H_
#define _DMM_H_
#include "../../../include/common.h"
#include "config.h"

/* DMS算法当前运行状态  */
typedef enum tag_DmmStatus_E
{
    DMM_RUN_INIT=0,             // 初始化
    DMM_RUN_IDEL,               // 空闲
    DMM_RUN_CALIBRATION_PRE,    // 预校准(预标定:动态指示当前设备预安装位置的合适程度)
    DMM_RUN_CALIBRATION,        // 正式校准(正式标定:确认安装位置后,采集多点确认司机凝视角度)
    DMM_RUN_REGISTER,           // 注册人脸
    DMM_RUN_RECOGNITION,        // 识别人脸
    DMM_RUN_DETECTION,          // DMS检测
    DMM_RUN_CHANGE_DRIVER,      // 换司机检测，CREARE客户用

    DMM_RUN_BUTT
} DMM_RUN_E;

/* DMS算法处理结果 */
typedef enum tag_DmmRes_E
{
    DMM_RES_SUCCESS = 0,        // 成功
    DMM_RES_RUNNING,            // 处理中
    DMM_RES_FAILURE,            // 失败
    DMM_RES_TIMEOUT,

    DMM_RES_BUTT
} DMM_RES_E;

/* 模块配置参数 */
typedef struct tag_DmmCfg_S
{
#if ALG_MUTLIT_BUFFER
    sint32          s32MediaBufFd[3];  /* 媒体通道Media Buffer的文件描述符 */
#else
	sint32          s32MediaBufFd;  /* 媒体通道Media Buffer的文件描述符 */
#endif
    sint32          s32Chn;         /* DMS算法媒体通道号 */
    CFG_ALG_PARAM   stAlgParam;     /* 算法配置参数 */
} DMM_CFG_PARAM_S;

/******************************************************************************
 * 函数功能: 初始化DMS算法模块
 * 输入参数: pstInitParam --- 初始化配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             ERR_NULL_PTR - 传入参数指针为NULL
             SV_FAILURE - 失败
 * 注意    : 无
 *****************************************************************************/
extern sint32 DMM_Init(DMM_CFG_PARAM_S *pstInitParam);

/******************************************************************************
 * 函数功能: 去初始化DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 无
 *****************************************************************************/
extern sint32 DMM_Fini();

/******************************************************************************
 * 函数功能: 启动DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_Start();

/******************************************************************************
 * 函数功能: 停止DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_Stop();

/******************************************************************************
 * 函数功能: 设置DMS算法模块配置参数
 * 输入参数: pstConnCfg --- 配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_ConfigSet(CFG_ALG_PARAM *pstCfgParam);

/******************************************************************************
 * 函数功能: 设置DMS算法运行状态
 * 输入参数: enRunStat --- 运行状态
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_SetRunStatus(DMM_RUN_E enRunStat);

/******************************************************************************
 * 函数功能: 获取DMS算法运行状态
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : 运行状态
 * 注意    : 
 *****************************************************************************/
extern DMM_RUN_E DMM_GetRunStatus();

/******************************************************************************
 * 函数功能: 获取DMS算法处理结果()
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : 运行结果
 * 注意    : 只用于状态:DMM_RUN_CALIBRATION/DMM_RUN_REGISTER/DMM_RUN_RECOGNITION
 *****************************************************************************/
extern DMM_RES_E DMM_GetRunResult(USER_INFO_S *pstUserInfo);

/******************************************************************************
 * 函数功能: 注册新用户人生成人脸信息
 * 输入参数: pszUserName --- 用户名
 * 输出参数: 无
 * 返回值  : 运行状态
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_RegisterUser(char *pszUserName);

/******************************************************************************
 * 函数功能: 删除用户人脸信息
 * 输入参数: pszUserName --- 用户名
 * 输出参数: 无
 * 返回值  : 运行状态
 * 注意    : 无
 *****************************************************************************/
extern sint32 DMM_DeleteUser(char *pszUserName);

/******************************************************************************
 * 函数功能: 批量删除用户人脸信息
 * 输入参数: pstDelUserList --- 批量删除的用户列表信息
 * 输出参数: 无
 * 返回值  : 运行状态
 * 注意    : 无
 *****************************************************************************/
extern sint32 DMM_DeleteUserBatch(USER_LIST_S *pstDelUserList);

/******************************************************************************
 * 函数功能: 修改用户人脸用户名
 * 输入参数: pszUserName --- 用户名/新用户名
 * 输出参数: 无
 * 返回值  : 运行状态
 * 注意    : 无
 *****************************************************************************/
extern sint32 DMM_ModifyUser(char *pszUserName);

/******************************************************************************
 * 函数功能: 获取当前注册的用户列表信息
 * 输入参数: 无
 * 输出参数: pstUserList --- 用户列表
 * 返回值  : 运行状态
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_GetUserList(USER_LIST_S *pstUserList);

/******************************************************************************
 * 函数功能: 从json文件中获取要删除的用户列表
 * 输入参数: 无
 * 输出参数: pstUserList --- 要删除的用户列表
 * 返回值  : 运行状态
 * 注意    : 
 *****************************************************************************/
extern sint32 DMM_GetUserListDelFormJson(USER_LIST_S *pstUserList);


#endif  /* _DMM_H_ */
