/****************************************************************
 File Name : FRAnalyzer.hpp
 Version: 1.0.0
 Author: lin jiaping
 Created: 2022-6-30
 Last Modified: 2022-6-30
 Description: 人脸识别分析类头文件
 Function list:
 History :
 2022-6-30, 按照代码编写规范重新编写代码
 2022-9-05, 增加更换司机检测功能
****************************************************************/

#ifndef FRANALYZER_H
#define FRANALYZER_H

#include "common.h"
#include <vector>
#include <dirent.h>
#define REGISTER_NEED_NUM 10            /*人脸注册所需要的帧数*/
#define MATCH_NEED_NUM 15
#define RECOGNITION_NEED_NUM 15         /*人脸识别所需要的帧数*/
#define FR_RECOGNITION_THR 0.575        /*人脸识别的阈值*/
#define FEATRUE_MERGE_THR 0.75          /*是否将所识别到的特征融合到数据库里相应特征的阈值*/
/*用户信息*/
struct STIDObject
{
    char ps8UserName[256];              /*用户对象的名字*/
    std::vector<float> vec_Feature;     /*用户对象的人脸特征*/
};

class CFRAnalyzer
{
    private:
        /********************Face ID***********************************/
        std::vector<STIDObject> m_vec_FaceFeatrues;  /*用户对象数据库*/
        char m_ps8RootPath[256];                     /*用户文件根路径*/
        int32_t m_s32IDsNum;                         /*用户个数*/
        std::vector<float> m_vec_TmpFeatrue;         /*临时存放人脸特征*/
        int32_t m_s32RegisterNum;                    /*注册人脸帧数计数*/
        int32_t m_s32RecognitionNum;                 /*识别人脸帧数计数*/
        float m_fLastPose[3];                        /*上一帧用户头部姿态（俯仰角，水平角，旋转角）*/
        int32_t m_s32CenterGaze;                     /*用户正视前方的水平角*/
        std::vector<int> m_vec_FrState;              /*用户识别结果ID计数*/
        int32_t m_s32FrID;                           /*最后用户识别结果ID*/
        /************************更换司机检测功能*************************/
        std::vector<float> m_vec_CurFeatrue;         /*当前司机人脸特征*/
        int32_t m_s32RecordNum;                      /*记录人脸特征帧数*/
        bool m_bMarkFROrNot;                         /*是否已经记录人脸特征*/
        int32_t m_s32MatchResult;                    /*前后司机匹配结果*/
        /***********************************************************
        功能：计算L2范数,并归一化特征
        参数：vec_Feat,人脸特征向量
        返回值：无
        应用：归一化特征向量
        ***********************************************************/
        void l2Norm(std::vector<float>& vec_Feat);
        /***********************************************************
        功能：计算两个向量余弦距离
        参数：vec_Feat1,输入人脸向量1
             vec_Feat2,输入人脸向量2
        返回值：余弦距离
        应用：判断两个向量的相似性
        ***********************************************************/
        float cosSimilarity(std::vector<float> vec_Feat1,std::vector<float> vec_Feat2);
        /***********************************************************
        功能：写入指定ID对应的人脸特征向量
        参数：s32IDIndex,用户ID
        返回值：无
        应用：更新用户人脸特征文件
        ***********************************************************/
        void writeFeatrue(int32_t s32IDIndex);
    public:
        /***********************************************************
        功能：人脸识别分析类构造函数
        参数：ps8RootPth,用户信息文件根路径
             s32CenterA,标定水平角（用户正视前方角度）
        返回值：无
        应用：创建人脸识别分析类对象
        ***********************************************************/
        CFRAnalyzer(char * ps8RootPth,int32_t s32CenterA);
        /***********************************************************
        功能：人脸识别分析类默认析构函数
        参数：无
        返回值：无
        应用：释放人脸识别分析类对象
        ***********************************************************/
        ~CFRAnalyzer(){}
        /**********************************************************
        功能：录入每帧人脸信息；
        参数：frP,人脸信息；
        输出：录入进度（0.0～1.0）
        应用：用于注册新用户
        ************************************************************/
        float FRRegister(frParam& frP);
        /**********************************************************
        功能：记录每帧人脸信息，并进行特征融合
        参数：frP,人脸信息；
        输出：录入进度（0.0～1.0）
        应用：用于识别用户
        ************************************************************/
        float FRRecognition(frParam& frP);
        /**********************************************************
        功能：写入用户信息，包括人脸图片和人脸特征
        参数：frP,人脸信息；
        输出：无
        应用：写入新用户信息
        ************************************************************/
        void WriteInfo(frParam& frP);
        /**********************************************************
        功能：读入根目录各用户的人脸特征向量
        参数：ps8Path,用户信息根目录；
        输出：无
        应用：读入用户数据库
        ************************************************************/
        void ReadFeatrue(char* ps8Path);
        /**********************************************************
        功能：获取人脸识别结果（对应的ID）
        参数：无
        输出：识别结果的ID
        应用：获取人脸识别结果
        ************************************************************/
        int GetFRId(){ return m_s32FrID;}
        /**********************************************************
        功能：获取数据库中用户数量
        参数：无
        输出：用户数量
        应用：获取用户数量
        ************************************************************/
        int GetIdNum(){ return m_s32IDsNum;}
        /**********************************************************
        功能：获取指定ID的用户名
        参数：🕒s32Id,指定ID
        输出：用户名
        应用：获取用户名
        ************************************************************/
        char* GetIdName(int32_t s32Id);
        /**********************************************************
        功能：更新设备标定角度
        参数：🕒s32CenterA,新的标定角度
        输出：无
        应用：更新设备标定角度
        ************************************************************/
        void CenterParamChange(int32_t s32CenterA)
        {
            m_s32CenterGaze = s32CenterA;
        }
        /***********************************************************
         功能：对前后司机的人脸特征进行匹配
         参数：frP,人脸信息；
         输出：匹配进度（0.0～1.0）
         应用：用于检测是否有更换司机
         ***********************************************************/
        float FRMatch(frParam& frP);
        /**********************************************************
         功能：获取司机匹配结果
         参数：无
         输出：匹配结果, 0为同一个人, -1不是同一个人
         应用：获取前后司机匹配结果
         ************************************************************/
         int GetMatchResult(){ return m_s32MatchResult;}
};
#endif //FRANALYZER_H
