/******************************************************************************
Copyright (C) 2021-2023 广州敏视数码科技有限公司版权所有.

文件名：pd.h

日期: 2021-08-03

文件功能描述: 定义行人检测算法功能接口

其他: // 其他内容说明

版本: v1.0.0(最新版本号)

*******************************************************************************/
#ifndef _PD_H_
#define _PD_H_
#include "../../../include/common.h"
#include "config.h"
#include "op.h"

/* 标定区域类型 / Calibration area type  */
typedef enum tagPdRoiType_E
{
    PD_ROI_RED = 0,                         /* 红区 */
    PD_ROI_YELLOW,                          /* 黄区 */
    PD_ROI_GREEN,                           /* 绿区 */
    PD_ROI_BLUE,                            /* 蓝区 */

    PD_ROI_BUTT
} PD_ROI_E;

/* 模块配置参数 / Module configuration parameters */
typedef struct tag_PdCfg_S
{
    SV_BOOL         bRotate;            /* 是否进行旋转 */
    sint32          s32SplitMode;       /* 视频多通道显示方式 */
    uint32          u32ChnNum;          /* PD算法通道数目 */
#if ALG_MUTLIT_BUFFER
    sint32          as32MediaBufFd[4][3]; /* 媒体通道Media Buffer的文件描述符 */
#else
	sint32          as32MediaBufFd[4];  /* 媒体通道Media Buffer的文件描述符 */
#endif
    sint32          as32MediaBufChn[4]; /* 媒体通道Media Buffer的对应通道 */
    uint32          u32Width;           /* 算法图片宽 */
    uint32          u32Height;          /* 算法图片高 */
    CFG_ALG_PARAM   stAlgParam;         /* 算法配置参数 */
} PD_CFG_PARAM_S;


/******************************************************************************
 * 函数功能: 初始化DMS算法模块
 * 输入参数: pstInitParam --- 初始化配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             ERR_NULL_PTR - 传入参数指针为NULL
             SV_FAILURE - 失败
 * 注意    : 无
 *****************************************************************************/
extern sint32 PD_Init(PD_CFG_PARAM_S *pstInitParam);

/******************************************************************************
 * 函数功能: 去初始化DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 无
 *****************************************************************************/
extern sint32 PD_Fini();

/******************************************************************************
 * 函数功能: 启动DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_Start();

/******************************************************************************
 * 函数功能: 停止DMS算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_Stop();

/******************************************************************************
 * 函数功能: 设置DMS算法模块配置参数
 * 输入参数: pstConnCfg --- 配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_ConfigSet(CFG_ALG_PARAM *pstCfgParam);

/******************************************************************************
 * 函数功能: 设置算法二维码标定
 * 输入参数: s32Chn --- 通道号
             pQRCode1 --- 第一个二维码的矩形框
             pQRCode2 --- 第二个二维码的矩形框
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 pd_QRCodeCaliberation(sint32 s32Chn, SV_POINT2_S *pQRCode1, SV_POINT2_S *pQRCode2);

/******************************************************************************
 * 函数功能: 由世界坐标映射到图像坐标
 * 输入参数: pstPointReal --- 世界坐标
             s32Chn --- 通道号
 * 输出参数: pstPointImage --- 图像坐标
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 pd_PointRealToImage(SV_3DPOINT2_S *pstPointReal, SV_POINT2_S *pstPointImage, sint32 s32Chn);

/******************************************************************************
 * 函数功能: 由图像坐标映射到世界坐标
 * 输入参数: pstPointImage --- 图像坐标
             s32Chn --- 通道号
 * 输出参数: pstPointReal --- 世界坐标
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 pd_PointImageToReal(SV_POINT2_S *pstPointImage, SV_3DPOINT2_S *pstPointReal, sint32 s32Chn);

/******************************************************************************
 * 函数功能: 设置视频输出方式，用于报警策略;
 * 输入参数: enSplitMode
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_SplitSet(sint32 enSplitMode);

/******************************************************************************
 * 函数功能: 设置旋转
 * 输入参数: bRotate    是否旋转
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_RotateSet(SV_BOOL bRotate);

/******************************************************************************
 * 函数功能: 发送CAN数据
 * 输入参数: pstCanData - CAN数据消息包
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 PD_SendCanData(MSG_CAN_DATA_S *pstCanData);

#endif  /* _PD_H_ */
