#ifndef _ZOOM_H_
#define _ZOOM_H_
#include "../../../include/common.h"
#include "config.h"
#include "op.h"


typedef struct 
{
    SV_BOOL         bEnable;            /* 算法是否开启 */
    sint32          s32SplitMode;       /* 视频多通道显示方式 */
    uint32          u32ChnNum;          /* PD算法通道数目 */
    sint32          as32MediaBufFd[4];  /* 媒体通道Media Buffer的文件描述符 */
    sint32          as32MediaBufChn[4]; /* 媒体通道Media Buffer的对应通道 */
    CFG_ALG_PARAM   stAlgParam;         /* 算法配置参数 */
} ZOOM_CFG_PARAM_S;
/******************************************************************************
 * 函数功能: 初始化变焦算法模块
 * 输入参数: pstInitParam --- 初始化配置参数
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             ERR_NULL_PTR - 传入参数指针为NULL
             SV_FAILURE - 失败
 * 注意    : 无
 *****************************************************************************/
extern sint32 Zoom_Init(ZOOM_CFG_PARAM_S *pstInitParam);

/******************************************************************************
 * 函数功能: 去初始化变焦算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 无
 *****************************************************************************/
extern sint32 Zoom_Fini();

/******************************************************************************
 * 函数功能: 启动变焦算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 Zoom_Start();

/******************************************************************************
 * 函数功能: 停止变焦算法模块
 * 输入参数: 无
 * 输出参数: 无
 * 返回值  : SV_SUCCESS - 成功
             SV_FAILURE - 其它错误
 * 注意    : 
 *****************************************************************************/
extern sint32 Zoom_Stop();

#endif  /* _ZOOM_H_ */